In [2]:
import pandas as pd

In [4]:
data = pd.read_csv('people-100.csv')

In [7]:
type(data)

pandas.core.frame.DataFrame

In [9]:
data.head(1)

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer

In [10]:
data.tail(2)

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
98,99,Adc7ad9B6e4A1Fe,Summer,Oconnell,Female,alexiscantrell@example.org,001-273-685-6932x092,2012-04-12,Broadcast journalist
99,100,b8D0aD3490FC7e1,Mariah,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

In [11]:
data.columns

Index(['Index', 'User Id', 'First Name', 'Last Name', 'Sex', 'Email', 'Phone',
       'Date of birth', 'Job Title'],
      dtype='object')

In [13]:
a=list(data.columns)

In [16]:
a[3:]

['Last Name', 'Sex', 'Email', 'Phone', 'Date of birth', 'Job Title']

In [22]:
data[ ['First Name','Last Name','Job Title'] ].head(3)

  First Name Last Name        Job Title
0     Shelby   Terrell  Games developer
1    Phillip   Summers   Phytotherapist
2   Kristine    Travis        Homeopath

In [1]:
import pandas as pd

In [3]:
data=pd.read_csv("Employee.csv")

In [5]:
data.head(2)

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
0,1,FAB0d41d5b5d22c,Ferrell LLC,https://price.net/,Papua New Guinea,Horizontal empowering knowledgebase,1990,Plastics,3498
1,2,6A7EdDEA9FaDC52,"Mckinney, Riley and Day",http://www.hall-buchanan.info/,Finland,User-centric system-worthy leverage,2015,Glass / Ceramics / Concrete,4952

In [6]:
data.tail(1)

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
99,100,e9eB5A60Cef8354,Watkins-Kaiser,http://www.herring.com/,Togo,Synergistic background access,2009,Financial Services,2785

In [7]:
data.columns

Index(['Index', 'Organization Id', 'Name', 'Website', 'Country', 'Description',
       'Founded', 'Industry', 'Number of employees'],
      dtype='object')

In [8]:
data[ ['Name','Description'] ].head(3)

                      Name                     Name
0              Ferrell LLC              Ferrell LLC
1  Mckinney, Riley and Day  Mckinney, Riley and Day
2               Hester Ltd               Hester Ltd

In [11]:
type(data['Name'])

pandas.core.series.Series

In [12]:
type(data[['Name']])

pandas.core.frame.DataFrame

In [15]:
data1=pd.read_excel("11_Time+Americans+Spend+Sleeping.xlsx")

In [16]:
data.head(3)

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
0,1,FAB0d41d5b5d22c,Ferrell LLC,https://price.net/,Papua New Guinea,Horizontal empowering knowledgebase,1990,Plastics,3498
1,2,6A7EdDEA9FaDC52,"Mckinney, Riley and Day",http://www.hall-buchanan.info/,Finland,User-centric system-worthy leverage,2015,Glass / Ceramics / Concrete,4952
2,3,0bFED1ADAE4bcC1,Hester Ltd,http://sullivan-reed.com/,China,Switchable scalable moratorium,1971,Public Safety,5287

In [31]:
data2=pd.read_excel("11_Time+Americans+Spend+Sleeping.xlsx",
              sheet_name="BLS Data Series", header=None, names =['a','b','c','d','e','f','g','h']).head(5)

In [35]:
data2.to_csv("test1.csv",index= False )

In [36]:
data2.to_excel("test2.xlsx",index= False )

In [41]:
#pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [45]:
!pip install lml 
#datahtml=pd.html("https://www.basketball-reference.com/leagues/NBA_2015_totals.html")

Requirement already satisfied: lml in /opt/conda/lib/python3.10/site-packages (0.1.0)

In [47]:
!pip install lxml

Collecting lxml
  Downloading lxml-4.9.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.manylinux_2_24_x86_64.whl (7.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.1/7.1 MB 35.8 MB/s eta 0:00:0000:0100:01
Installing collected packages: lxml
Successfully installed lxml-4.9.2

In [51]:
!pip install lxml
import pandas as pd1 
data2 = pd1.read_html('https://www.basketball-reference.com/leagues/NBA_2015_totals.html')

Requirement already satisfied: lxml in /opt/conda/lib/python3.10/site-packages (4.9.2)

ImportError: lxml not found, please install it